uhnp/src/InformationRegisters/ВерсииГрафиковРасчетов/ВерсииГрафиковРасчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВерсииГрафиковРасчетов</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ОпорныйГрафик</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>План</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВерсияГрафика</name>
    <type>
      <types>DefinedType.ВерсияГрафика</types>
    </type>
  </resources>
  <dimensions>
    <name>ПредметГрафика</name>
    <type>
      <types>DefinedType.ПредметГрафика</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/AccumulationRegisters/РасчетыСКонтрагентамиГрафики/РасчетыСКонтрагентамиГрафики.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РасчетыСКонтрагентамиГрафики</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <attributes>
    <name>СтатьяБюджета</name>
    <type>
      <types>DefinedType.СтатьиБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриходРасход</name>
    <type>
      <types>EnumRef.ВидыДвиженийПриходРасход</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаПлатежа</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПлатежа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КурсПлатежа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КратностьПлатежа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика1</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика2</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика3</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика4</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика5</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика6</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦФО</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидБюджета</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Операция</name>
    <comment>Операция графика</comment>
    <type>
      <types>CatalogRef.ОперацииГрафиковДоговоров</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетОрганизации</name>
    <type>
      <types>DefinedType.БанковскийСчетОрганизации</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетКонтрагента</name>
    <type>
      <types>DefinedType.БанковскийСчетКонтрагента</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументРегистратор</name>
    <type>
      <types>DefinedType.РегистрацияДанныхБюджетированияСсылки</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговораУХ</name>
    <type>
      <types>CatalogRef.ВидыДоговоровКонтрагентовУХ</types>
    </type>
  </attributes>
  <attributes>
    <name>БезакцептноеСписание</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ВерсияГрафика</name>
    <type>
      <types>DefinedType.ВерсияГрафика</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПредметГрафика</name>
    <type>
      <types>DefinedType.ПредметГрафика</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЭлементСтруктурыЗадолженности</name>
    <type>
      <types>EnumRef.ЭлементыСтруктурыЗадолженности</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

uhnp/src/InformationRegisters/РазмещениеЗаявок/РазмещениеЗаявок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РазмещениеЗаявок</name>
  <resources>
    <name>БанковскийСчетКасса</name>
    <type>
      <types>DefinedType.БанковскийСчетКасса</types>
    </type>
  </resources>
  <resources>
    <name>Контрагент</name>
    <type>
      <types>DefinedType.АналитикаПланированияКонтрагент</types>
    </type>
  </resources>
  <resources>
    <name>СуммаВзаиморасчетов</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>ФормаОплаты</name>
    <type>
      <types>EnumRef.ФормыОплаты</types>
    </type>
  </resources>
  <resources>
    <name>ВалютаВзаиморасчетов</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>Проведен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КурсПлатежа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>21</precision>
        <scale>10</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗапретИзмененияДаты</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВалютаОплаты</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>ВидОперацииУХ</name>
    <type>
      <types>CatalogRef.ВидыОперацийУХ</types>
    </type>
  </resources>
  <resources>
    <name>ДатаИсполнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>СчетКонтрагента</name>
    <type>
      <types>DefinedType.БанковскийСчетКонтрагента</types>
    </type>
  </resources>
  <resources>
    <name>ЗапретИзмененияБанковскогоСчетаКассы</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЗапретРазбиенияСлияния</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторВстречнойПозиции</name>
    <type>
      <types>UUID</types>
    </type>
  </resources>
  <resources>
    <name>КратностьПлатежа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Организация</name>
    <type>
      <types>DefinedType.Организации</types>
    </type>
  </resources>
  <resources>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>DefinedType.Договор</types>
    </type>
  </resources>
  <resources>
    <name>Приоритет</name>
    <type>
      <types>CatalogRef.ПриоритетыПлатежей</types>
    </type>
  </resources>
  <resources>
    <name>БезакцептноеСписание</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СпособОпределенияКурсаПлатежа</name>
    <type>
      <types>EnumRef.СпособыОпределенияКурсаПлатежа</types>
    </type>
  </resources>
  <resources>
    <name>ДатаФиксацииКурсаПлатежа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>КурсПлатежаНеБолее</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КурсПлатежаНеМенее</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КурсПлатежаНеМенееВВалютеОплаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КурсПлатежаНеБолееВВалютеОплаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СдвигДатыФиксацииКурсаПлатежа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КрайняяДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>КурсУстановленВЗаявке</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <resources>
    <name>ЛицевойСчет</name>
    <type>
      <types>CatalogRef.БанковскиеСчетаКонтрагентов</types>
    </type>
  </resources>
  <dimensions>
    <name>ЗаявкаНаОперацию</name>
    <type>
      <types>DefinedType.ДокументыПлатежнойПозиции</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПриходРасход</name>
    <type>
      <types>EnumRef.ВидыДвиженийПриходРасход</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторПозиции</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/СостоянияИсполненияДокументовПланирования/СостоянияИсполненияДокументовПланирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостоянияИсполненияДокументовПланирования</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>СостояниеИсполнения</name>
    <type>
      <types>EnumRef.СостоянияИсполненияЗаявки</types>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументИзменившийСостояние</name>
    <type>
      <types>DefinedType.ДокументыИзменяющиеСостояниеДокументовПланирования</types>
    </type>
  </attributes>
  <dimensions>
    <name>ДокументПланирования</name>
    <type>
      <types>DefinedType.ДокументыПлатежнойПозиции</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторПозиции</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/РегистрСостоянийОбъектов/РегистрСостоянийОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РегистрСостоянийОбъектов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>СостояниеОбъекта</name>
    <type>
      <types>EnumRef.СостоянияИнцидентов</types>
      <types>EnumRef.СостоянияСогласования</types>
      <types>EnumRef.СтатусыВыгружаемыхОбъектовЕИС</types>
      <types>EnumRef.СостоянияДоговоров</types>
      <types>EnumRef.СостоянияТранзакций</types>
      <types>EnumRef.СостоянияМероприятий</types>
      <types>EnumRef.СостоянияПроектов</types>
      <types>CatalogRef.СостоянияСогласования</types>
      <types>EnumRef.СостоянияОтчетов</types>
      <types>EnumRef.СтатусыЛотов</types>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DefinedType.ОбъектыДляСогласования</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Enums/ВариантыОплаты/ВариантыОплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВариантыОплаты</name>
  <enumValues>
    <name>Аванс</name>
  </enumValues>
  <enumValues>
    <name>Постоплата</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/СпособыРасчетаКоличестваДнейВПериоде/СпособыРасчетаКоличестваДнейВПериоде.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыРасчетаКоличестваДнейВПериоде</name>
  <enumValues>
    <name>ПоРабочимДням</name>
  </enumValues>
  <enumValues>
    <name>ПоКалендарнымДням</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/ВидыДвиженийПриходРасход/ВидыДвиженийПриходРасход.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДвиженийПриходРасход</name>
  <enumValues>
    <name>Приход</name>
  </enumValues>
  <enumValues>
    <name>Расход</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/СостоянияИсполненияЗаявки/СостоянияИсполненияЗаявки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияИсполненияЗаявки</name>
  <enumValues>
    <name>НеОбработана</name>
  </enumValues>
  <enumValues>
    <name>Отложена</name>
  </enumValues>
  <enumValues>
    <name>ВключенаВРеестрПлатежей</name>
  </enumValues>
  <enumValues>
    <name>НаИсполнении</name>
  </enumValues>
  <enumValues>
    <name>Исполнена</name>
  </enumValues>
  <enumValues>
    <name>Отменена</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/РежимыИспользованияГрафика/РежимыИспользованияГрафика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РежимыИспользованияГрафика</name>
  <enumValues>
    <name>РезервированиеБюджетаИКонтрольСоблюденияГрафика</name>
  </enumValues>
  <enumValues>
    <name>АвтоматическоеСозданиеПлатежныхПозиций</name>
  </enumValues>
  <enumValues>
    <name>ТолькоРезервированиеБюджета</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/CommonModules/РасчетГрафиковОперацийУХ/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Модуль содержит процедуры и функции, необходимые для расчета графиков платежей по условиям оплаты.
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область РасчетГрафика

Функция РассчитатьГрафикПоУсловиюОплаты(Знач УсловиеОплаты, Знач ДатаОтсчета, Знач ОбщаяСумма, Знач ПроизводственныйКалендарь = Неопределено, Знач ОтДатыНачисления = Истина, Знач ПозицияПлатежа = 0, Знач ТолькоПостоплата = Ложь) Экспорт
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("Дата", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
	Результат.Колонки.Добавить("СуммаНачисление", РаботаСКурсамиВалют.ОписаниеТипаДенежногоПоля());
	Результат.Колонки.Добавить("СуммаОплата", РаботаСКурсамиВалют.ОписаниеТипаДенежногоПоля());
	
	Если НЕ ЗначениеЗаполнено(УсловиеОплаты) Тогда 
		// Расчет невозможен.
		Возврат Результат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ПроизводственныйКалендарь) Тогда 
		ПроизводственныйКалендарь = Константы.ПроизводственныйКалендарьПоУмолчанию.Получить();
	КонецЕсли;
	
	Если ОтДатыНачисления Тогда
		ДатаНачисления = ДатаОтсчета;
	Иначе
		// Определим дату начисления.
		КоличествоУсловий = УсловиеОплаты.ЭтапыОплаты.Количество();
		Если (КоличествоУсловий = 0) Или (ПозицияПлатежа > УсловиеОплаты.ЭтапыОплаты.Количество() - 1) Тогда
			
			// Нет такой позиции.
			Возврат Результат;
			
		КонецЕсли;
		
		ИсходныйЭтапОплаты = УсловиеОплаты.ЭтапыОплаты[ПозицияПлатежа];
		
		Если ИсходныйЭтапОплаты.ВариантОплаты = Перечисления.ВариантыОплаты.Аванс Тогда
			ДатаНачисления = ДатаОтБазовойДатыСоСдвигом(ДатаОтсчета, ИсходныйЭтапОплаты.Срок, ИсходныйЭтапОплаты.ТипСрока, ПроизводственныйКалендарь);
		Иначе
			ДатаНачисления = ДатаОтсчета;
		КонецЕсли;
		
	КонецЕсли;
	
	// Добавим в график начисление.
	ОперацияНачисления = Результат.Добавить();
	ОперацияНачисления.Дата = ДатаНачисления;
	ОперацияНачисления.СуммаНачисление = ОбщаяСумма;
	
	ВариантыОплатыАванса = РасчетГрафиковОперацийЕХ.ВариантыОплатыАванса();
	
	Для Каждого ЭтапОплаты Из УсловиеОплаты.ЭтапыОплаты Цикл
		
		Если ОтДатыНачисления И ЭтапОплаты.ВариантОплаты = Перечисления.ВариантыОплаты.Аванс И ТолькоПостоплата Тогда
			Продолжить;
		ИначеЕсли НЕ ОтДатыНачисления И УсловиеОплаты.ЭтапыОплаты.Индекс(ЭтапОплаты) < ПозицияПлатежа Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяОплата = Результат.Добавить();
		
		НоваяОплата.Дата = ДатаОплаты(ДатаНачисления, ЭтапОплаты, ПроизводственныйКалендарь, ВариантыОплатыАванса);
		
		НоваяОплата.СуммаОплата = ОбщаяСумма * ЭтапОплаты.ПроцентОплаты / 100;
		
	КонецЦикла;
	
	Результат.Сортировать("Дата");
	
	Возврат Результат;
	
КонецФункции

Функция ДатаОтБазовойДатыСоСдвигом(БазоваяДата, КоличествоДней, Знач СпособРасчетаКоличестваДней, ПроизводственныйКалендарь = Неопределено) Экспорт
	
	Если СпособРасчетаКоличестваДней = Перечисления.СпособыРасчетаКоличестваДнейВПериоде.ПоКалендарнымДням Тогда 
		ДатаРезультат = БазоваяДата + КоличествоДней * 24 * 60 * 60;
	Иначе 
		ДатаРезультат = КалендарныеГрафикиУХ.ПолучитьДатуПоКалендарю(
			ПроизводственныйКалендарь, 
			БазоваяДата,
			КоличествоДней);
	КонецЕсли;
	
	Возврат ДатаРезультат;     
	
КонецФункции

Функция ПолучитьГрафикЭтаповОплаты(Знач ОбщаяСумма, Знач БазоваяДата, Знач ПараметрыПозиций, ТолькоПостоплата = Ложь) Экспорт

	ЭтапыГрафикаОплаты = ПараметрыПозиций.ЭтапыГрафикаОплаты;
	ПроизводственныйКалендарь = ПараметрыПозиций.ПроизводственныйКалендарь;
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("Дата", , ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
	Результат.Колонки.Добавить("Сумма", , РаботаСКурсамиВалют.ОписаниеТипаДенежногоПоля());
	
	Если ОбщаяСумма = 0 
		Или Не ЗначениеЗаполнено(ЭтапыГрафикаОплаты) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Если ПроизводственныйКалендарь = Неопределено Тогда
		ПроизводственныйКалендарь = Константы.ПроизводственныйКалендарьПоУмолчанию.Получить();
	КонецЕсли;
	
	МассивКоэффициентов = ЭтапыГрафикаОплаты.ВыгрузитьКолонку("ПроцентПлатежа");
	РаспределенныеСуммы = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(ОбщаяСумма, МассивКоэффициентов);
	
	Для Каждого ЭтапОплаты Из ЭтапыГрафикаОплаты Цикл
		
		Если ТолькоПостоплата 
			И Не ПараметрыПозиций.ВариантыОплатыАванса.Найти(ЭтапОплаты.ВариантОплаты) = Неопределено Тогда
			Продолжить;         
		КонецЕсли;                 
		
		ИндексЭтапа = ЭтапыГрафикаОплаты.Индекс(ЭтапОплаты);
		
		НоваяОплата = Результат.Добавить();
		НоваяОплата.Дата = ДатаОплаты(БазоваяДата, ЭтапОплаты, ПроизводственныйКалендарь, ПараметрыПозиций);
		НоваяОплата.Сумма = РаспределенныеСуммы[ИндексЭтапа];
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьДатуНачисленияПоДатеПервойОперации(ДатаПервойОперации, ПараметрыПозиций) Экспорт
	
	Если Не ПараметрыПозиций.ЭтапыГрафикаОплаты.Количество() Тогда
		Возврат ДатаПервойОперации;
	КонецЕсли;
	
	ИсходныйЭтапОплаты = ПараметрыПозиций.ЭтапыГрафикаОплаты[0];

	Если ПараметрыПозиций.ВариантыОплатыАванса.Найти(ИсходныйЭтапОплаты.ВариантОплаты) = Неопределено Тогда
		ДатаНачисления = ДатаПервойОперации;	
	Иначе   		
		ДатаНачисления = ДатаОтБазовойДатыСоСдвигом(ДатаПервойОперации, ИсходныйЭтапОплаты.Сдвиг, ПараметрыПозиций.СпособРасчетаКоличестваДней, ПараметрыПозиций.ПроизводственныйКалендарь);	
	КонецЕсли; 
	
	Возврат ДатаНачисления;
	
КонецФункции

Функция ГрафикиРасчетаСовпадают(ТабГрафика1, ТабГрафика2) Экспорт

	Если Тип(ТабГрафика1) = Тип("ТаблицаЗначений") Тогда
		Таб1 = ТабГрафика1.Скопировать();
	Иначе
		Таб1 = ТабГрафика1.Выгрузить();
	КонецЕсли;
	
	Если Тип(ТабГрафика2) = Тип("ТаблицаЗначений") Тогда
		Таб2 = ТабГрафика2.Скопировать();
	Иначе
		Таб2 = ТабГрафика2.Выгрузить();
	КонецЕсли;
	
	Если Таб1.Колонки.Найти("ИдентификаторПозицииГрафика") <> Неопределено Тогда
		Таб1.Колонки.Удалить("ИдентификаторПозицииГрафика");
	КонецЕсли;
	
	Если Таб2.Колонки.Найти("ИдентификаторПозицииГрафика") <> Неопределено Тогда
		Таб2.Колонки.Удалить("ИдентификаторПозицииГрафика");
	КонецЕсли;
	
	Если Таб1.Колонки.Найти("НомерСтроки") <> Неопределено Тогда
		Таб1.Колонки.Удалить("НомерСтроки");
	КонецЕсли;
	
	Если Таб2.Колонки.Найти("НомерСтроки") <> Неопределено Тогда
		Таб2.Колонки.Удалить("НомерСтроки");
	КонецЕсли;

	Возврат ОбщегоНазначения.ДанныеСовпадают(Таб1, Таб2);
	
КонецФункции

#КонецОбласти

// Процедура формирует документы "Заявка на операцию" на основании графика оплаты.
// Возвращаемое значение:
//  Массив - Перечень сформированных заявок на оплату.
Функция СформироватьЗаявкиПоГрафикуОплаты(ОбъектыРасчетов = Неопределено, Знач ДатаНачала = Неопределено, 
										Знач ДатаОкончания = Неопределено, Начисления = Истина ) Экспорт 
	
	ТекущаяДатаСеанса = ТекущаяДатаСеанса();
	
	Интервал = Константы.СрокАвтоОтправкиЗаявокНаСогласование.Получить();
	МаксДатаОтправкиНаСогласование = КонецДня(ТекущаяДатаСеанса + 86400 * Интервал);
	
	Если Не ЗначениеЗаполнено(ДатаНачала) Тогда
		ДатаНачала = НачалоДня(ТекущаяДатаСеанса);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДатаОкончания) Тогда
		ДатаОкончания = КонецДня(ТекущаяДатаСеанса + 86400 * Константы.ГоризонтФормированияЗаявокПоГрафикам.Получить());
	КонецЕсли;
	
	Результат = Новый Массив;
	
	Запрос = Новый Запрос;
	Если ОбъектыРасчетов = Неопределено Тогда
		// Сформируем список потенциальных объектов расчетов.
		Запрос.Текст = ДоговорыКонтрагентовВстраиваниеУХ.ТекстЗапросаВсеОбъектыРасчетов();
		
	Иначе
		// 
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВерсииГрафиковРасчетовСрезПоследних.ПредметГрафика КАК ПредметГрафика,
		|	ВерсииГрафиковРасчетовСрезПоследних.ВерсияГрафика КАК Регистратор
		|ПОМЕСТИТЬ ВТ_Сделки
		|ИЗ
		|	РегистрСведений.ВерсииГрафиковРасчетов.СрезПоследних(,ПредметГрафика В (&ОбъектыРасчетов)) КАК ВерсииГрафиковРасчетовСрезПоследних";
		
		Запрос.УстановитьПараметр("ОбъектыРасчетов", ОбъектыРасчетов);
		
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета() + 
		"ВЫБРАТЬ
		|	ГрафикиРасчетов.Организация КАК Организация,
		|	ГрафикиРасчетов.Контрагент КАК Контрагент,
		|	ГрафикиРасчетов.ПредметГрафика КАК ОбъектРасчетов,
		|	ГрафикиРасчетов.СтатьяБюджета КАК СтатьяДвиженияДенежныхСредств,
		|	ГрафикиРасчетов.Период КАК Дата,
		|	ГрафикиРасчетов.ПриходРасход КАК ПриходРасход,
		|	СУММА(ГрафикиРасчетов.Сумма) КАК СуммаГрафик,
		|	ЕСТЬNULL(ГрафикиРасчетов.Операция.ВидОперацииУХ, ВЫБОР
		|			КОГДА ГрафикиРасчетов.ПриходРасход = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПриходРасход.Расход)
		|				ТОГДА ВЫРАЗИТЬ(ГрафикиРасчетов.ПредметГрафика КАК Справочник.ДоговорыКонтрагентов).ВидДоговораУХ.ВидОперацииУХСписание
		|			ИНАЧЕ ВЫРАЗИТЬ(ГрафикиРасчетов.ПредметГрафика КАК Справочник.ДоговорыКонтрагентов).ВидДоговораУХ.ВидОперацииУХПоступление
		|		КОНЕЦ) КАК ВидОперацииУХ,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ГрафикиРасчетов.ВерсияГрафика) = ТИП(Документ.ВерсияСоглашенияАккредитив)
		|			ТОГДА ЕСТЬNULL(ВерсияСоглашенияАккредитивБезакцептноеСписаниеДенежныхСредств.БезакцептноеСписание, ЛОЖЬ)
		|		КОГДА ТИПЗНАЧЕНИЯ(ГрафикиРасчетов.ВерсияГрафика) = ТИП(Документ.ВерсияСоглашенияБанковскаяГарантия)
		|			ТОГДА ЕСТЬNULL(ВерсияСоглашенияБанковскаяГарантияБезакцептноеСписаниеДенежныхСредств.БезакцептноеСписание, ЛОЖЬ)
		|		КОГДА ТИПЗНАЧЕНИЯ(ГрафикиРасчетов.ВерсияГрафика) = ТИП(Документ.ВерсияСоглашенияКоммерческийДоговор)
		|			ТОГДА ЕСТЬNULL(ВерсияСоглашенияКоммерческийДоговорБезакцептноеСписаниеДенежныхСредств.БезакцептноеСписание, ЛОЖЬ)
		|		КОГДА ТИПЗНАЧЕНИЯ(ГрафикиРасчетов.ВерсияГрафика) = ТИП(Документ.ВерсияСоглашенияКредит)
		|			ТОГДА ЕСТЬNULL(ВерсияСоглашенияКредитБезакцептноеСписаниеДенежныхСредств.БезакцептноеСписание, ЛОЖЬ)
		|	КОНЕЦ КАК БезакцептноеСписание,
		|	ГрафикиРасчетов.Аналитика1 КАК Аналитика1,
		|	ГрафикиРасчетов.Аналитика2 КАК Аналитика2,
		|	ГрафикиРасчетов.Аналитика3 КАК Аналитика3,
		|	ГрафикиРасчетов.Аналитика4 КАК Аналитика4,
		|	ГрафикиРасчетов.Аналитика5 КАК Аналитика5,
		|	ГрафикиРасчетов.Аналитика6 КАК Аналитика6,
		|	ГрафикиРасчетов.ЦФО КАК ЦФО,
		|	ГрафикиРасчетов.Проект КАК Проект,
		|	ГрафикиРасчетов.Валюта КАК Валюта,
		|	ГрафикиРасчетов.СчетОрганизации КАК СчетОрганизации,
		|	ГрафикиРасчетов.СчетКонтрагента КАК СчетКонтрагента,
		|	ГрафикиРасчетов.ЭлементСтруктурыЗадолженности КАК ЭлементСтруктурыЗадолженности,
		|	ГрафикиРасчетов.ВидБюджета КАК ВидБюджета
		|ПОМЕСТИТЬ ВТ_ГрафикиБезакцептноеСписание
		|ИЗ
		|	РегистрНакопления.РасчетыСКонтрагентамиГрафики КАК ГрафикиРасчетов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Сделки КАК ВТ_Сделки
		|		ПО ГрафикиРасчетов.ВерсияГрафика = ВТ_Сделки.Регистратор
		|			И (ГрафикиРасчетов.СтатьяБюджета ССЫЛКА Справочник.СтатьиДвиженияДенежныхСредств
		|				ИЛИ ГрафикиРасчетов.СтатьяБюджета ССЫЛКА Справочник.СтатьиДоходовИРасходов
		|				ИЛИ ГрафикиРасчетов.СтатьяБюджета ССЫЛКА Справочник.СтатьиДвиженияРесурсов)
		|			И (ГрафикиРасчетов.Период МЕЖДУ &ДатаНачала И &ДатаОкончания)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВерсияСоглашенияАккредитив.БезакцептноеСписаниеДенежныхСредств КАК ВерсияСоглашенияАккредитивБезакцептноеСписаниеДенежныхСредств
		|		ПО ((ВЫРАЗИТЬ(ГрафикиРасчетов.ВерсияГрафика КАК Документ.ВерсияСоглашенияАккредитив)) = ВерсияСоглашенияАккредитивБезакцептноеСписаниеДенежныхСредств.Ссылка)
		|			И ГрафикиРасчетов.ЭлементСтруктурыЗадолженности = ВерсияСоглашенияАккредитивБезакцептноеСписаниеДенежныхСредств.ЭлементСтруктурыЗадолженности
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВерсияСоглашенияБанковскаяГарантия.БезакцептноеСписаниеДенежныхСредств КАК ВерсияСоглашенияБанковскаяГарантияБезакцептноеСписаниеДенежныхСредств
		|		ПО ((ВЫРАЗИТЬ(ГрафикиРасчетов.ВерсияГрафика КАК Документ.ВерсияСоглашенияБанковскаяГарантия)) = ВерсияСоглашенияБанковскаяГарантияБезакцептноеСписаниеДенежныхСредств.Ссылка)
		|			И ГрафикиРасчетов.ЭлементСтруктурыЗадолженности = ВерсияСоглашенияБанковскаяГарантияБезакцептноеСписаниеДенежныхСредств.ЭлементСтруктурыЗадолженности
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВерсияСоглашенияКоммерческийДоговор.БезакцептноеСписаниеДенежныхСредств КАК ВерсияСоглашенияКоммерческийДоговорБезакцептноеСписаниеДенежныхСредств
		|		ПО ((ВЫРАЗИТЬ(ГрафикиРасчетов.ВерсияГрафика КАК Документ.ВерсияСоглашенияКоммерческийДоговор)) = ВерсияСоглашенияКоммерческийДоговорБезакцептноеСписаниеДенежныхСредств.Ссылка)
		|			И ГрафикиРасчетов.ЭлементСтруктурыЗадолженности = ВерсияСоглашенияКоммерческийДоговорБезакцептноеСписаниеДенежныхСредств.ЭлементСтруктурыЗадолженности
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВерсияСоглашенияКредит.БезакцептноеСписаниеДенежныхСредств КАК ВерсияСоглашенияКредитБезакцептноеСписаниеДенежныхСредств
		|		ПО ((ВЫРАЗИТЬ(ГрафикиРасчетов.ВерсияГрафика КАК Документ.ВерсияСоглашенияКредит)) = ВерсияСоглашенияКредитБезакцептноеСписаниеДенежныхСредств.Ссылка)
		|			И ГрафикиРасчетов.ЭлементСтруктурыЗадолженности = ВерсияСоглашенияКредитБезакцептноеСписаниеДенежныхСредств.ЭлементСтруктурыЗадолженности
		|
		|СГРУППИРОВАТЬ ПО
		|	ГрафикиРасчетов.Организация,
		|	ГрафикиРасчетов.Контрагент,
		|	ГрафикиРасчетов.ВидБюджета,
		|	ГрафикиРасчетов.ПредметГрафика,
		|	ГрафикиРасчетов.СтатьяБюджета,
		|	ГрафикиРасчетов.Период,
		|	ГрафикиРасчетов.ПриходРасход,
		|	ЕСТЬNULL(ГрафикиРасчетов.Операция.ВидОперацииУХ, ВЫБОР
		|			КОГДА ГрафикиРасчетов.ПриходРасход = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПриходРасход.Расход)
		|				ТОГДА ВЫРАЗИТЬ(ГрафикиРасчетов.ПредметГрафика КАК Справочник.ДоговорыКонтрагентов).ВидДоговораУХ.ВидОперацииУХСписание
		|			ИНАЧЕ ВЫРАЗИТЬ(ГрафикиРасчетов.ПредметГрафика КАК Справочник.ДоговорыКонтрагентов).ВидДоговораУХ.ВидОперацииУХПоступление
		|		КОНЕЦ),
		|	ГрафикиРасчетов.Аналитика1,
		|	ГрафикиРасчетов.Аналитика2,
		|	ГрафикиРасчетов.Аналитика3,
		|	ГрафикиРасчетов.Аналитика4,
		|	ГрафикиРасчетов.Аналитика5,
		|	ГрафикиРасчетов.Аналитика6,
		|	ГрафикиРасчетов.ЦФО,
		|	ГрафикиРасчетов.Проект,
		|	ГрафикиРасчетов.Валюта,
		|	ГрафикиРасчетов.СчетОрганизации,
		|	ГрафикиРасчетов.СчетКонтрагента,
		|	ГрафикиРасчетов.ЭлементСтруктурыЗадолженности,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ГрафикиРасчетов.ВерсияГрафика) = ТИП(Документ.ВерсияСоглашенияАккредитив)
		|			ТОГДА ЕСТЬNULL(ВерсияСоглашенияАккредитивБезакцептноеСписаниеДенежныхСредств.БезакцептноеСписание, ЛОЖЬ)
		|		КОГДА ТИПЗНАЧЕНИЯ(ГрафикиРасчетов.ВерсияГрафика) = ТИП(Документ.ВерсияСоглашенияБанковскаяГарантия)
		|			ТОГДА ЕСТЬNULL(ВерсияСоглашенияБанковскаяГарантияБезакцептноеСписаниеДенежныхСредств.БезакцептноеСписание, ЛОЖЬ)
		|		КОГДА ТИПЗНАЧЕНИЯ(ГрафикиРасчетов.ВерсияГрафика) = ТИП(Документ.ВерсияСоглашенияКоммерческийДоговор)
		|			ТОГДА ЕСТЬNULL(ВерсияСоглашенияКоммерческийДоговорБезакцептноеСписаниеДенежныхСредств.БезакцептноеСписание, ЛОЖЬ)
		|		КОГДА ТИПЗНАЧЕНИЯ(ГрафикиРасчетов.ВерсияГрафика) = ТИП(Документ.ВерсияСоглашенияКредит)
		|			ТОГДА ЕСТЬNULL(ВерсияСоглашенияКредитБезакцептноеСписаниеДенежныхСредств.БезакцептноеСписание, ЛОЖЬ)
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Графики.Организация КАК Организация,
		|	ВТ_Графики.Контрагент КАК Контрагент,
		|	ВТ_Графики.ОбъектРасчетов КАК ОбъектРасчетов,
		|	ВТ_Графики.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
		|	ВТ_Графики.Дата КАК Дата,
		|	ВТ_Графики.ПриходРасход КАК ПриходРасход,
		|	ВТ_Графики.СуммаГрафик КАК СуммаГрафик,
		|	ВТ_Графики.ВидОперацииУХ КАК ВидОперацииУХ,
		|	ВТ_Графики.БезакцептноеСписание КАК БезакцептноеСписание,
		|	ВТ_Графики.Аналитика1 КАК Аналитика1,
		|	ВТ_Графики.Аналитика2 КАК Аналитика2,
		|	ВТ_Графики.Аналитика3 КАК Аналитика3,
		|	ВТ_Графики.Аналитика4 КАК Аналитика4,
		|	ВТ_Графики.Аналитика5 КАК Аналитика5,
		|	ВТ_Графики.Аналитика6 КАК Аналитика6,
		|	ВТ_Графики.ЦФО КАК ЦФО,
		|	ВТ_Графики.Проект КАК Проект,
		|	ВТ_Графики.Валюта КАК Валюта,
		|	ВТ_Графики.СчетОрганизации КАК СчетОрганизации,
		|	ВТ_Графики.СчетКонтрагента КАК СчетКонтрагента,
		|	ВТ_Графики.ЭлементСтруктурыЗадолженности КАК ЭлементСтруктурыЗадолженности,
		|	ВТ_Графики.ВидБюджета КАК ВидБюджета
		|ПОМЕСТИТЬ ВТ_Графики
		|ИЗ
		|	ВТ_ГрафикиБезакцептноеСписание КАК ВТ_Графики
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РазмещениеЗаявок.ЗаявкаНаОперацию КАК ЗаявкаНаОперацию,
		|	ВЫБОР                                                               
		|		Когда РазмещениеЗаявок.ЗаявкаНаОперацию Ссылка  Документ.ЗаказПоставщику
		|			Тогда РазмещениеЗаявок.ЗаявкаНаОперацию           
		|		Когда РазмещениеЗаявок.ЗаявкаНаОперацию Ссылка  Документ.ЗаказКлиента
		|			Тогда РазмещениеЗаявок.ЗаявкаНаОперацию
		|		КОГДА НЕ РазмещениеЗаявок.ДоговорКонтрагента ЕСТЬ NULL
		|				И РазмещениеЗаявок.ДоговорКонтрагента <> НЕОПРЕДЕЛЕНО   
		|			ТОГДА РазмещениеЗаявок.ДоговорКонтрагента
		|		КОГДА НЕ РазмещениеЗаявок.ЗаявкаНаОперацию.ОбъектРасчетов ЕСТЬ NULL
		|				И РазмещениеЗаявок.ЗаявкаНаОперацию.ОбъектРасчетов <> НЕОПРЕДЕЛЕНО
		|			ТОГДА РазмещениеЗаявок.ЗаявкаНаОперацию.ОбъектРасчетов
		|	КОНЕЦ КАК ОбъектРасчетов,
		|	ДвиженияБюджетированияПоПозициям.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
		|	РазмещениеЗаявок.ДатаИсполнения КАК Дата,
		|	РазмещениеЗаявок.ПриходРасход КАК ПриходРасход,
		|	ДвиженияБюджетированияПоПозициям.СуммаВзаиморасчетов КАК СуммаПоДокументам,
		|	РегистрСостоянийОбъектовСрезПоследних.СостояниеОбъекта КАК СостояниеОбъекта,
		|	ДвиженияБюджетированияПоПозициям.Аналитика1 КАК Аналитика1,
		|	ДвиженияБюджетированияПоПозициям.Аналитика2 КАК Аналитика2,
		|	ДвиженияБюджетированияПоПозициям.Аналитика3 КАК Аналитика3,
		|	ДвиженияБюджетированияПоПозициям.Аналитика4 КАК Аналитика4,
		|	ДвиженияБюджетированияПоПозициям.Аналитика5 КАК Аналитика5,
		|	ДвиженияБюджетированияПоПозициям.Аналитика6 КАК Аналитика6,
		|	ДвиженияБюджетированияПоПозициям.ЦФО КАК ЦФО,
		|	ДвиженияБюджетированияПоПозициям.Проект КАК Проект,
		|	РазмещениеЗаявок.СчетКонтрагента КАК СчетКонтрагента,
		|	РазмещениеЗаявок.БанковскийСчетКасса КАК СчетОрганизации,
		|	ДвиженияБюджетированияПоПозициям.ЭлементСтруктурыЗадолженности КАК ЭлементСтруктурыЗадолженности
		|ПОМЕСТИТЬ ВТ_Исполнение
		|ИЗ
		|	РегистрСведений.РазмещениеЗаявок КАК РазмещениеЗаявок
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДвиженияБюджетированияПоПозициям КАК ДвиженияБюджетированияПоПозициям
		|		ПО РазмещениеЗаявок.ИдентификаторПозиции = ДвиженияБюджетированияПоПозициям.ИдентификаторПозиции
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияИсполненияДокументовПланирования.СрезПоследних КАК СостоянияИсполненияДокументовПланированияСрезПоследних
		|		ПО РазмещениеЗаявок.ИдентификаторПозиции = СостоянияИсполненияДокументовПланированияСрезПоследних.ИдентификаторПозиции
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РегистрСостоянийОбъектов.СрезПоследних КАК РегистрСостоянийОбъектовСрезПоследних
		|		ПО РазмещениеЗаявок.ЗаявкаНаОперацию = РегистрСостоянийОбъектовСрезПоследних.Объект
		|ГДЕ
		|	ВЫБОР
		|			КОГДА НЕ РазмещениеЗаявок.ДоговорКонтрагента ЕСТЬ NULL
		|					И РазмещениеЗаявок.ДоговорКонтрагента <> НЕОПРЕДЕЛЕНО
		|				ТОГДА РазмещениеЗаявок.ДоговорКонтрагента
		|			КОГДА НЕ РазмещениеЗаявок.ЗаявкаНаОперацию.ОбъектРасчетов ЕСТЬ NULL
		|					И РазмещениеЗаявок.ЗаявкаНаОперацию.ОбъектРасчетов <> НЕОПРЕДЕЛЕНО
		|				ТОГДА РазмещениеЗаявок.ЗаявкаНаОперацию.ОбъектРасчетов
		|		КОНЕЦ В
		|			(ВЫБРАТЬ
		|				ВТ_Сделки.ПредметГрафика
		|			ИЗ
		|				ВТ_Сделки КАК ВТ_Сделки)
		|	И ЕСТЬNULL(СостоянияИсполненияДокументовПланированияСрезПоследних.СостояниеИсполнения, ЗНАЧЕНИЕ(Перечисление.СостоянияИсполненияЗаявки.НеОбработана)) В (ЗНАЧЕНИЕ(Перечисление.СостоянияИсполненияЗаявки.НеОбработана), ЗНАЧЕНИЕ(Перечисление.СостоянияИсполненияЗаявки.ВключенаВРеестрПлатежей), ЗНАЧЕНИЕ(Перечисление.СостоянияИсполненияЗаявки.НаИсполнении))
		|	И РазмещениеЗаявок.ЗаявкаНаОперацию.Проведен
		|	И (РазмещениеЗаявок.ЗаявкаНаОперацию.ЭтоОперацияПоГрафику
		|		ИЛИ 
		|		(РазмещениеЗаявок.ЗаявкаНаОперацию.ИспользованиеГрафикаРасчетовБДДС 
		|			= ЗНАЧЕНИЕ(Перечисление.РежимыИспользованияГрафика.АвтоматическоеСозданиеПлатежныхПозиций)
		|			И 
		|			НЕ РазмещениеЗаявок.ЗаявкаНаОперацию.ПорядокРасчетов  В
		|		(Значение(Перечисление.ПорядокРасчетов.ПоЗаказамНакладным), Значение(Перечисление.ПорядокРасчетов.ПоНакладным))) 
		|		ИЛИ РазмещениеЗаявок.ЗаявкаНаОперацию.РежимИспользованияГрафика 
		|			= ЗНАЧЕНИЕ(Перечисление.РежимыИспользованияГрафика.АвтоматическоеСозданиеПлатежныхПозиций)
		|)
        |	И РазмещениеЗаявок.ДатаИсполнения МЕЖДУ &ДатаНачала И &ДатаОкончания
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Графики.ОбъектРасчетов КАК ОбъектРасчетов,
		|	ВТ_Графики.ОбъектРасчетов.СтавкаНДС КАК СтавкаНДС,
		|	ВТ_Графики.ОбъектРасчетов.Подразделение КАК Подразделение,
		|	ВТ_Графики.Организация КАК Организация,
		|	ВТ_Графики.Контрагент КАК Контрагент,
		|	ВТ_Графики.СтатьяДвиженияДенежныхСредств КАК СтатьяБюджета,
		|	ВТ_Графики.Дата КАК ДатаНачала,
		|	ВТ_Графики.Дата КАК ЖелательнаяДатаПлатежа,
		|	ВТ_Графики.Дата КАК КрайняяДата,
		|	ВТ_Графики.Дата КАК ДатаПлатежа,
		|	ВТ_Графики.ПриходРасход КАК ПриходРасход,
		|	ВТ_Графики.СуммаГрафик - ЕСТЬNULL(Исполнение.СуммаПоДокументам, 0) КАК СуммаДокумента,
		|	ВТ_Графики.ВидОперацииУХ КАК ВидОперацииУХ,
		|	ВТ_Графики.ВидБюджета КАК ВидБюджета,
		|	ВТ_Графики.БезакцептноеСписание КАК БезакцептноеСписание,
		|	ИСТИНА КАК ЭтоОперацияПоГрафику,
		|	ВТ_Графики.Аналитика1 КАК Аналитика1,
		|	ВТ_Графики.Аналитика2 КАК Аналитика2,
		|	ВТ_Графики.Аналитика3 КАК Аналитика3,
		|	ВТ_Графики.Аналитика4 КАК Аналитика4,
		|	ВТ_Графики.Аналитика5 КАК Аналитика5,
		|	ВТ_Графики.Аналитика6 КАК Аналитика6,
		|	ВТ_Графики.ЦФО КАК ЦФО,
		|	ВТ_Графики.Проект КАК Проект,
		|	ВТ_Графики.ЭлементСтруктурыЗадолженности КАК ЭлементСтруктурыЗадолженности,
		|	ВТ_Графики.СчетОрганизации КАК БанковскийСчет,
		|	ВТ_Графики.СчетКонтрагента КАК БанковскийСчетКонтрагента,
		|	ВТ_Графики.Валюта КАК Валюта,
		|	ВТ_Графики.ОбъектРасчетов.ОсновнаяВалютаПлатежей КАК ВалютаОплаты
		|ИЗ
		|	ВТ_Графики КАК ВТ_Графики
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ВТ_Исполнение.ОбъектРасчетов КАК ОбъектРасчетов,
		|			ВТ_Исполнение.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
		|			ВТ_Исполнение.Дата КАК Дата,
		|			ВТ_Исполнение.ПриходРасход КАК ПриходРасход,
		|			СУММА(ВТ_Исполнение.СуммаПоДокументам) КАК СуммаПоДокументам,
		|			ВТ_Исполнение.Аналитика1 КАК Аналитика1,
		|			ВТ_Исполнение.Аналитика2 КАК Аналитика2,
		|			ВТ_Исполнение.Аналитика3 КАК Аналитика3,
		|			ВТ_Исполнение.Аналитика4 КАК Аналитика4,
		|			ВТ_Исполнение.Аналитика5 КАК Аналитика5,
		|			ВТ_Исполнение.Аналитика6 КАК Аналитика6,
		|			ВТ_Исполнение.ЦФО КАК ЦФО,
		|			ВТ_Исполнение.Проект КАК Проект,
		|			ВТ_Исполнение.СчетКонтрагента КАК СчетКонтрагента,
		|			ВТ_Исполнение.СчетОрганизации КАК СчетОрганизации,
		|			ВТ_Исполнение.ЭлементСтруктурыЗадолженности КАК ЭлементСтруктурыЗадолженности
		|		ИЗ
		|			ВТ_Исполнение КАК ВТ_Исполнение
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ВТ_Исполнение.ОбъектРасчетов,
		|			ВТ_Исполнение.СтатьяДвиженияДенежныхСредств,
		|			ВТ_Исполнение.Дата,
		|			ВТ_Исполнение.ПриходРасход,
		|			ВТ_Исполнение.Аналитика1,
		|			ВТ_Исполнение.Аналитика2,
		|			ВТ_Исполнение.Аналитика3,
		|			ВТ_Исполнение.Аналитика4,
		|			ВТ_Исполнение.Аналитика5,
		|			ВТ_Исполнение.Аналитика6,
		|			ВТ_Исполнение.ЦФО,
		|			ВТ_Исполнение.Проект,
		|			ВТ_Исполнение.СчетКонтрагента,
		|			ВТ_Исполнение.СчетОрганизации,
		|			ВТ_Исполнение.ЭлементСтруктурыЗадолженности) КАК Исполнение
		|		ПО ВТ_Графики.ОбъектРасчетов = Исполнение.ОбъектРасчетов
		|			И ВТ_Графики.СтатьяДвиженияДенежныхСредств = Исполнение.СтатьяДвиженияДенежныхСредств
		|			И ВТ_Графики.Дата = Исполнение.Дата
		|			И ВТ_Графики.ПриходРасход = Исполнение.ПриходРасход
		|			И ВТ_Графики.Аналитика1 = Исполнение.Аналитика1
		|			И ВТ_Графики.Аналитика2 = Исполнение.Аналитика2
		|			И ВТ_Графики.Аналитика3 = Исполнение.Аналитика3
		|			И ВТ_Графики.Аналитика4 = Исполнение.Аналитика4
		|			И ВТ_Графики.Аналитика5 = Исполнение.Аналитика5
		|			И ВТ_Графики.Аналитика6 = Исполнение.Аналитика6
		|			И (ВЫБОР
		|				КОГДА Исполнение.ЦФО = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
		|					ТОГДА ИСТИНА
		|				КОГДА ВТ_Графики.ЦФО = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ Исполнение.ЦФО = ВТ_Графики.ЦФО
		|			КОНЕЦ)
		|			И (ВЫБОР
		|				КОГДА Исполнение.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|					ТОГДА ИСТИНА
		|				КОГДА ВТ_Графики.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ Исполнение.Проект = ВТ_Графики.Проект
		|			КОНЕЦ)
		|			И (ВЫБОР
		|				КОГДА ЕСТЬNULL(ВТ_Графики.СчетОрганизации, ЗНАЧЕНИЕ(Справочник.БанковскиеСчетаОрганизаций.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.БанковскиеСчетаОрганизаций.ПустаяСсылка)
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ ВТ_Графики.СчетОрганизации = Исполнение.СчетОрганизации
		|			КОНЕЦ)
		|			И (ВЫБОР
		|				КОГДА ЕСТЬNULL(ВТ_Графики.СчетКонтрагента, ЗНАЧЕНИЕ(Справочник.БанковскиеКартыКонтрагентов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.БанковскиеСчетаОрганизаций.ПустаяСсылка)
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ ВТ_Графики.СчетКонтрагента = Исполнение.СчетКонтрагента
		|			КОНЕЦ)
		|			И ВТ_Графики.ЭлементСтруктурыЗадолженности = Исполнение.ЭлементСтруктурыЗадолженности
		|			И ВТ_Графики.СуммаГрафик = Исполнение.СуммаПоДокументам
		|ГДЕ
		|	ВТ_Графики.СуммаГрафик - ЕСТЬNULL(Исполнение.СуммаПоДокументам, 0) > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Исполнение.ЗаявкаНаОперацию КАК ЗаявкаНаОперацию
		|ИЗ
		|	ВТ_Исполнение КАК ВТ_Исполнение
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Графики КАК ВТ_Графики
		|		ПО ВТ_Исполнение.ОбъектРасчетов = ВТ_Графики.ОбъектРасчетов
		|			И ВТ_Исполнение.СтатьяДвиженияДенежныхСредств = ВТ_Графики.СтатьяДвиженияДенежныхСредств
		|			И ВТ_Исполнение.Дата = ВТ_Графики.Дата
		|			И ВТ_Исполнение.ПриходРасход = ВТ_Графики.ПриходРасход
		|			И ВТ_Исполнение.Аналитика1 = ВТ_Графики.Аналитика1
		|			И ВТ_Исполнение.Аналитика2 = ВТ_Графики.Аналитика2
		|			И ВТ_Исполнение.Аналитика3 = ВТ_Графики.Аналитика3
		|			И ВТ_Исполнение.Аналитика4 = ВТ_Графики.Аналитика4
		|			И ВТ_Исполнение.Аналитика5 = ВТ_Графики.Аналитика5
		|			И ВТ_Исполнение.Аналитика6 = ВТ_Графики.Аналитика6
		|			И (ВЫБОР
		|				КОГДА ВТ_Исполнение.ЦФО = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
		|					ТОГДА ИСТИНА
		|				КОГДА ВТ_Графики.ЦФО = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ ВТ_Исполнение.ЦФО = ВТ_Графики.ЦФО
		|			КОНЕЦ)
		|			И (ВЫБОР
		|				КОГДА ВТ_Исполнение.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|					ТОГДА ИСТИНА
		|				КОГДА ВТ_Графики.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ ВТ_Исполнение.Проект = ВТ_Графики.Проект
		|			КОНЕЦ)
		|			И (ВЫБОР
		|				КОГДА ЕСТЬNULL(ВТ_Графики.СчетОрганизации, ЗНАЧЕНИЕ(Справочник.БанковскиеСчетаОрганизаций.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.БанковскиеСчетаОрганизаций.ПустаяСсылка)
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ ВТ_Графики.СчетОрганизации = ВТ_Исполнение.СчетОрганизации
		|			КОНЕЦ)
		|			И (ВЫБОР
		|				КОГДА ЕСТЬNULL(ВТ_Графики.СчетКонтрагента, ЗНАЧЕНИЕ(Справочник.БанковскиеКартыКонтрагентов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.БанковскиеСчетаОрганизаций.ПустаяСсылка)
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ ВТ_Графики.СчетКонтрагента = ВТ_Исполнение.СчетКонтрагента
		|			КОНЕЦ)
		|			И ВТ_Исполнение.ЭлементСтруктурыЗадолженности = ВТ_Графики.ЭлементСтруктурыЗадолженности
		|			И ВТ_Исполнение.СуммаПоДокументам = ВТ_Графики.СуммаГрафик
		|ГДЕ
		|	ВТ_Графики.СуммаГрафик ЕСТЬ NULL";

	Запрос.УстановитьПараметр("ДатаНачала", 	ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", 	ДатаОкончания);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	КоличествоЭлементов = РезультатЗапроса.Количество();
	
	ИмяСобытияЖР = НСтр("ru = 'Формирование заявок по графикам оплат'", ОбщегоНазначения.КодОсновногоЯзыка());
	
	// Удаляем неактуальные документы 
	ЗаявкиКОтменеПроведения = РезультатЗапроса[КоличествоЭлементов - 1].Выгрузить().ВыгрузитьКолонку("ЗаявкаНаОперацию");
	Для Каждого Заявка Из ЗаявкиКОтменеПроведения Цикл
		Попытка
			Заявка.ПолучитьОбъект().УстановитьПометкуУдаления(Истина);
		Исключение
			ОписаниеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ЗаписьЖурналаРегистрации(ИмяСобытияЖР, УровеньЖурналаРегистрации.Ошибка, , Заявка, ОписаниеОшибки);
			ОбщегоНазначения.СообщитьПользователю(Нстр("ru = 'Не удалось отменить проведение заявки на оплату:'") 
				+ Символы.ПС + ОписаниеОшибки);
		КонецПопытки;	
	КонецЦикла;
	
	ДанныеДляСозданияЗаявок = РезультатЗапроса[КоличествоЭлементов - 2].Выгрузить();

	БюджетДвиженияДенежныхСредств = Перечисления.ПредназначенияЭлементовСтруктурыОтчета.БюджетДвиженияДенежныхСредств; 
	БюджетДоходовИРасходов = Перечисления.ПредназначенияЭлементовСтруктурыОтчета.БюджетДоходовИРасходов;

	СоздаватьЗаявкиНаОплатуПланируемыеПоступленияДС = ПолучитьФункциональнуюОпцию("СоздаватьЗаявкиНаОплатуПланируемыеПоступленияДС");  
	СоздаватьЗаявкиНаРасходПланируемыеДоходы = ПолучитьФункциональнуюОпцию("СоздаватьЗаявкиНаРасходПланируемыеДоходы"); 
	
	Для Каждого ТекСтрока Из ДанныеДляСозданияЗаявок Цикл
		
		ИмяРеквизитаЖелаемаяДата	= "ДатаНачала";

		МенеджерДокументаБДДС = ЗаявкиНаОперации.ПолучитьМенеджерЗаявки(БюджетДвиженияДенежныхСредств, ТекСтрока.ПриходРасход);
		МенеджерДокументаБДР = ЗаявкиНаОперации.ПолучитьМенеджерЗаявки(БюджетДоходовИРасходов, ТекСтрока.ПриходРасход);
		
		Попытка
			Если СоздаватьЗаявкиНаОплатуПланируемыеПоступленияДС 
				И ТекСтрока.ВидБюджета = ПланыВидовХарактеристик.ВидыБюджетов.БюджетДвиженияДенежныхСредств Тогда
				
				ДокументОбъект = МенеджерДокументаБДДС.СоздатьДокумент();
				
				СтруктураЗаполнения = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(ТекСтрока);
				ДокументОбъект.Заполнить(СтруктураЗаполнения);
				
				Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДокументОбъект, ИмяРеквизитаЖелаемаяДата) Тогда
					Если ДокументОбъект[ИмяРеквизитаЖелаемаяДата] > МаксДатаОтправкиНаСогласование Тогда
						ДокументОбъект.ДополнительныеСвойства.Вставить("НеОтправлятьНаСогласованиеПриПроведении", Истина);
					КонецЕсли;
				Иначе
					Если ДокументОбъект.ЖелательнаяДатаПлатежа > МаксДатаОтправкиНаСогласование Тогда
						ДокументОбъект.ДополнительныеСвойства.Вставить("НеОтправлятьНаСогласованиеПриПроведении", Истина);
					КонецЕсли;
				КонецЕсли;
				
				Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДокументОбъект, "ЭтоОперацияПоГрафику") Тогда
					ДокументОбъект.ЭтоОперацияПоГрафику = Истина;				
				КонецЕсли; 
				
				ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
				
				ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
				Результат.Добавить(ДокументОбъект.Ссылка);
			КонецЕсли; 
			
		Исключение
			ОписаниеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ЗаписьЖурналаРегистрации(ИмяСобытияЖР, УровеньЖурналаРегистрации.Ошибка, , , ОписаниеОшибки);
			ОбщегоНазначения.СообщитьПользователю(Нстр("ru = 'Не удалось провести заявку на оплату:'") 
													+ Символы.ПС + ОписаниеОшибки);
			
		КонецПопытки;
		
		Попытка
			Если ТекСтрока.ВидБюджета <> ПланыВидовХарактеристик.ВидыБюджетов.БюджетДвиженияДенежныхСредств
				 И СоздаватьЗаявкиНаРасходПланируемыеДоходы И Начисления Тогда
				
				ДокументОбъект = МенеджерДокументаБДР.СоздатьДокумент();
				
				СтруктураЗаполнения = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(ТекСтрока);
				ДокументОбъект.Заполнить(СтруктураЗаполнения);                                     
				РеквизитыДокумента = ЗаявкиНаОперации.РеквизитыДокументаЗаявка(ТипЗнч(ДокументОбъект.Ссылка));
				ИмяРеквизитаЖелаемаяДата = РеквизитыДокумента.ПланируемаяДатаОперации.ИмяРеквизита;
	           	
				Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДокументОбъект, ИмяРеквизитаЖелаемаяДата) Тогда
					Если ДокументОбъект[ИмяРеквизитаЖелаемаяДата] > МаксДатаОтправкиНаСогласование Тогда
						ДокументОбъект.ДополнительныеСвойства.Вставить("НеОтправлятьНаСогласованиеПриПроведении", Истина);
					КонецЕсли;
				Иначе
					Если ДокументОбъект.ЖелательнаяДатаРасхода > МаксДатаОтправкиНаСогласование Тогда
						ДокументОбъект.ДополнительныеСвойства.Вставить("НеОтправлятьНаСогласованиеПриПроведении", Истина);
					КонецЕсли;
				КонецЕсли;   
				
				Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДокументОбъект, "ЭтоОперацияПоГрафику") Тогда
					ДокументОбъект.ЭтоОперацияПоГрафику = Истина;				
				КонецЕсли; 
				
				ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
				
				ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
				Результат.Добавить(ДокументОбъект.Ссылка);
			КонецЕсли; 
		Исключение
			ОписаниеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ЗаписьЖурналаРегистрации(ИмяСобытияЖР, УровеньЖурналаРегистрации.Ошибка, , , ОписаниеОшибки);
			ОбщегоНазначения.СообщитьПользователю(Нстр("ru = 'Не удалось провести заявку на оплату:'") 
													+ Символы.ПС + ОписаниеОшибки);

		КонецПопытки;	
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция РаспределитьПланНаФактГрафикаНакладной(ИсхПланГрафика, ИсхФактГрафика, 
							Знач ДатаНакладной, Знач ДатаАктуализации) Экспорт
	
	ДатаНакладной = НачалоДня(ДатаНакладной);
	ДатаАктуализации = НачалоДня(ДатаАктуализации);
	
	ПланГрафика = ИсхПланГрафика.Скопировать();
	ПланГрафика.Колонки.Добавить("Распределено", ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
	ПланГрафика.Сортировать("Дата");
	
	НовыйГрафик = ИсхФактГрафика.Скопировать();
	НовыйГрафик.Колонки.Добавить("Распределено", ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
	НовыйГрафик.Сортировать("Дата");
	
	// * дата начала внесения корректировок в график 
	// - ближайшая к текущей дате плановая пост оплата,
	// 	 аванс не корректируем, считаем что если произошла отгрузка, то значит аванс достаточен
	ДатаНачалаКорректировки = Дата(1, 1, 1);
	Для каждого СтрокаПлан Из ПланГрафика Цикл
	
		Если СтрокаПлан.Дата >= ДатаНакладной 
			И СтрокаПлан.Дата >= ДатаАктуализации Тогда
			
			ДатаНачалаКорректировки = СтрокаПлан.Дата;
			Прервать;
		КонецЕсли;		
	КонецЦикла;
		
	Если НЕ ЗначениеЗаполнено(ДатаНачалаКорректировки) Тогда
		ДатаНачалаКорректировки = ДатаАктуализации;
	КонецЕсли;
	
	// * распределение плановых оплат на факт
	Для каждого СтрокаПлан Из ПланГрафика Цикл
			
		Если СтрокаПлан.Сумма <= 0 Тогда
			Продолжить; // некорректные данные
		КонецЕсли;
		
		Для каждого СтрокаФакт Из НовыйГрафик Цикл
			Если СтрокаФакт.ЭлементСтруктурыЗадолженности = СтрокаПлан.ЭлементСтруктурыЗадолженности
				И СтрокаФакт.КолонкаСекции = СтрокаПлан.КолонкаСекции Тогда
					
				Остаток = (СтрокаФакт.Сумма - СтрокаФакт.Распределено);
				Если Остаток > 0 Тогда
					Распределено = Мин(Остаток, СтрокаПлан.Сумма - СтрокаПлан.Распределено);
					СтрокаФакт.Распределено = СтрокаФакт.Распределено + Распределено;
					СтрокаПлан.Распределено = СтрокаПлан.Распределено + Распределено;
				КонецЕсли;
				
				Если СтрокаПлан.Распределено = СтрокаПлан.Сумма Тогда
					Прервать;
				КонецЕсли;			
			КонецЕсли;
		КонецЦикла;
		
		Если СтрокаПлан.Распределено < СтрокаПлан.Сумма Тогда
					
			Распределено = (СтрокаПлан.Сумма - СтрокаПлан.Распределено);
			НоваяСтрока = НовыйГрафик.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаПлан);
			НоваяСтрока.Дата = ?(СтрокаПлан.Дата >= ДатаНачалаКорректировки, СтрокаПлан.Дата, ДатаНачалаКорректировки);
			НоваяСтрока.Сумма = Распределено;
			НоваяСтрока.СуммаРасчет = Распределено;
			НоваяСтрока.Распределено = Распределено;		
		КонецЕсли;			
	КонецЦикла;
	
	// свертка строк
	НовыйГрафик.Колонки.Удалить("НомерСтроки");
	НовыйГрафик.Колонки.Удалить("Распределено");
	НовыйГрафик.ЗаполнитьЗначения(Неопределено, "ИдентификаторПозицииГрафика"); // пересоздадим потом
	ОбщегоНазначенияУХ.СвернутьПоИзмерениям(НовыйГрафик, , "Сумма, СуммаРасчет, СуммаКорректировка");
	
	Для Каждого СтрокаГрафика Из НовыйГрафик Цикл
		СтрокаГрафика.ИдентификаторПозицииГрафика = Новый УникальныйИдентификатор;
	КонецЦикла;
	
	НовыйГрафик.Сортировать("Дата");
	
	Возврат НовыйГрафик;
		
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьБазовыеДаты(Знач АлгоритмыБазовыхДат, Знач ДокументОснование)
	
	Результат = Новый Соответствие;
	Для Каждого Алгоритм Из АлгоритмыБазовыхДат Цикл 
		Результат.Вставить(Алгоритм, БазоваяДатаПоАлгоритму(Алгоритм, ДокументОснование));
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Функция возвращает базовую дату по заданному алгоритму на основании некоторых входных данных.
//
// Параметры:
//  Алгоритм			 - СправочникСсылка.АлгоритмыОпределенияБазовойДаты	 - Определяет способ вычисления даты.
//  ДанныеДляРасчетов	 - Произвольный	 - Данные, необходимые для вычисления даты.
// Возвращаемое значение:
//  Дата - Базовая дата.
Функция БазоваяДатаПоАлгоритму(Знач Алгоритм, Знач ДанныеДляРасчетов)
	
	БазоваяДата = Дата(1, 1, 1);
	Если Алгоритм = Справочники.АлгоритмыОпределенияБазовойДаты.ДатаРасчетногоДокумента Тогда 
		БазоваяДата = ДатаРасчетногоДокумента(ДанныеДляРасчетов);
	ИначеЕсли Алгоритм = Справочники.АлгоритмыОпределенияБазовойДаты.ДатаВходящегоДокумента Тогда
		БазоваяДата = ДатаВходящегоДокумента(ДанныеДляРасчетов);
	КонецЕсли;
	
	РасчетГрафиковОперацийПереопределяемыйУХ.БазоваяДатаПоАлгоритму(БазоваяДата, Алгоритм, ДанныеДляРасчетов);
	
	Возврат БазоваяДата;
	
КонецФункции

Функция ДатаРасчетногоДокумента(ДанныеДляРасчетов)
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеДляРасчетов, "Дата");
		
КонецФункции

Функция ДатаВходящегоДокумента(ДанныеДляРасчетов)
	
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("ДатаВходящегоДокумента", ДанныеДляРасчетов.Метаданные()) Тогда 
		Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеДляРасчетов, "ДатаВходящегоДокумента");
	Иначе 
		Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеДляРасчетов, "Дата"); 
	КонецЕсли;
	
КонецФункции

Функция ДатаОплаты(БазоваяДата, ЭтапОплаты, ПроизводственныйКалендарь, ПараметрыПозиций)
	
	КоличествоДней = ЭтапОплаты.Сдвиг; 
	
	Если Не ПараметрыПозиций.ВариантыОплатыАванса.Найти(ЭтапОплаты.ВариантОплаты) = Неопределено Тогда
		КоличествоДней = - КоличествоДней;	
	КонецЕсли;
	
	Возврат ДатаОтБазовойДатыСоСдвигом(БазоваяДата, КоличествоДней, 
				ПараметрыПозиций.СпособРасчетаКоличестваДней, ПроизводственныйКалендарь);
	
КонецФункции

Функция БазоваяСумма(ДанныеДляРасчетов)
	
	Значение = 0;
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("СуммаДокумента", ДанныеДляРасчетов.Метаданные()) Тогда 
		Значение = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеДляРасчетов, "СуммаДокумента");
	КонецЕсли; 
	
	Возврат Значение;
	
КонецФункции

#КонецОбласти
